resume.org
#+TITLE: Hsiang-Jui Lin (Jerry Lin) | 林祥瑞
#+OPTIONS: toc:nil num:nil timestamp:nil author:nil creator:nil validate:nil
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \setmainfont{Liberation Serif}
#+LATEX_HEADER: \setCJKmainfont{Noto Sans CJK TC}
#+LATEX_HEADER: \usepackage[margin=0.6in]{geometry}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \hypersetup{colorlinks=true,linkcolor=blue,urlcolor=blue}
#+LATEX_HEADER: \pagestyle{empty}
#+LATEX_HEADER: \setlength{\parskip}{0pt}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \titlespacing*{\section}{0pt}{8pt}{4pt}
#+LATEX_HEADER: \titlespacing*{\subsection}{0pt}{6pt}{3pt}
#+HTML_HEAD: <style type="text/css"> body { font-family: Arial, sans-serif; max-width: 800px; margin: 0 auto; padding: 20px; } h2 { border-bottom: 2px solid #ccc; padding-bottom: 5px; } dt { font-weight: bold; } dd { margin-bottom: 10px; } .contact-info { text-align: center; margin-bottom: 20px; } .contact-info a { margin: 0 10px; } </style>

#+BEGIN_CENTER
*Email:* [[mailto:jerry73204@gmail.com][jerry73204@gmail.com]] | [[mailto:d10922013@csie.ntu.edu.tw][d10922013@csie.ntu.edu.tw]] \\
*GitHub:* [[https://github.com/jerry73204/][github.com/jerry73204]] | *LinkedIn:* [[https://www.linkedin.com/in/jerryhj-lin/][linkedin.com/in/jerryhj-lin]]
#+END_CENTER

-----

PhD candidate at National Taiwan University specializing in autonomous vehicle systems, multi-modal sensor fusion, and V2X communication. Systems programmer with expertise in Rust, C/C++, and distributed consensus algorithms. 5+ years of industry experience in R&D roles at Microsoft and ADLINK Technology, with a focus on scalable backend systems and real-time networking.

* Education

- *PhD Program in Computer Science and Information Engineering, National Taiwan University* (2021–Present): Advisor: Professor Chi-Sheng Shih | Research: Autonomous vehicles, sensor fusion, V2X communication

- *Master of Science in Computer Science and Information Engineering, National Taiwan University* (2021)

- *Bachelor of Science in Computer Science and Information Engineering, National Taiwan University* (2016): Thesis: /Solving Graph Domination Problems on Distance-Hereditary Graphs Using Split Decomposition/

* Research Projects

- *AutoSDV (Autoware Software-Defined Vehicle)* (2023–Present): Main contributor to [[https://newslabntu.github.io/autosdv-book/][AutoSDV]], an open-source autonomous driving platform. Designed and implemented the complete vehicle architecture and software stack based on Autoware. Developed hardware integration for practical sensors, enabling affordable self-driving research platforms for educational institutions.

- *Multi-Modal Autonomous Vehicle Communication Control* (2023–2024): Led development of innovative communication protocols for heterogeneous autonomous vehicle platforms in collaboration with KingwayTek (勤崴國際).

- *Real-Time Perception and Collaborative Driving* (2021–2023): Developed V2V cooperative decision-making algorithms and collaborative perception systems with National Yang Ming Chiao Tung University.

- *Cross-Domain Time-Sensitive Networking* (2022–2023): Researched deterministic networking protocols using time-sensitive networking (TSN) technologies for vehicular applications with ADLINK Technology (凌華科技).

- *Smart Cockpit Interactive Systems* (2023–2025): Leading research on gesture-based interaction and spatial audio systems for next-generation vehicle interiors with AU Optronics Corporation (友達光電).

* Publications & Presentations

** Publications

- *Unsupervised Training Framework for 3D Point Cloud Object Detection Model* (2025): Developing self-supervised learning approaches for 3D object detection in autonomous driving applications.

- *Self-Supervised Multi-LiDAR Object View Generation Using Single LiDAR* (2023): Proposed novel method for generating multi-view LiDAR representations from single sensor input, improving perception robustness.

- *A Performance Study on the Throughput and Latency of Zenoh, MQTT, Kafka, and DDS* (2023): Comprehensive evaluation of pub/sub frameworks demonstrating significant throughput improvements in specific scenarios. (1 citation)

- *Scalable and Bounded-time Decisions on Edge Device Networks using Eclipse Zenoh* (RTSCA 2022): Developed consensus algorithm achieving deterministic decision-making within 100ms bounds. (4 citations)

- *Prediction of Human Intention in Vehicles, Pedestrians and Bicyclists Interactions* (IEEE ITSC 2021): Developed deep learning models for predicting road user behavior, improving autonomous vehicle safety. (1 citation)

- *Master's Thesis: Occlusion-Resistant Tracking Based on Idempotent Adjunction Relationships* (2021): Achieved 0.3m average displacement error in vehicle tracking under 70% occlusion conditions.

- *Undergraduate Thesis: Graph Domination Problems on Distance-Hereditary Graphs* (2016): Discovered O(n²) algorithm improving upon previous O(n³) solutions.

- *機器人程式設計與實作：使用 Java* (Robotic Programming Design and Implementation Using Java) (2013): Published technical book on LEGO NXT robotics programming. ISBN: [[http://isbn.ncl.edu.tw/NCL_ISBNNet/main_DisplayRecord.php?PHPSESSID=c8kchinqo5ncq873i47c4sqkb0&Pact=Display&Pstart=1][9789862768228]]

** Presentations

- *ROS2 ♥ Rust* (COSCUP 2024): Presented integration techniques for using Rust with ROS2 (Robot Operating System 2), showcasing type-safe robotics programming and performance benefits. [[https://coscup.org/2024/zh-TW/session/3XZS7K][Session details]]

- *Highly Performant Dataflow in Stream-Oriented Programming with Rust* (COSCUP 2023): Demonstrated significant performance improvements using async stream processing. [[https://coscup.org/2023/zh-TW/session/JLZM37][Session details]]

* Professional Experience

- *Research & Development Assistant, ADLINK Technology Inc.* (2021–2024): Developed distributed consensus algorithms for Eclipse Zenoh middleware, achieving sub-millisecond latency for edge computing applications.

- *Research & Development Assistant, Microsoft Taiwan* (2018–2019): Optimized Bing's reverse geocoding backend services, improving query response time and system scalability.

- *Software Developer, CAVEDU Education* (CAVEDU 教育團隊) (2010–2016): Led AppInventor curriculum development. Authored technical documentation and conducted workshops on robotics programming.

* Technical Skills

*Programming Languages:* Rust, C/C++, Python, Java, CUDA, OpenCL

*Frameworks & Tools:* Autoware, ROS/ROS2, PyTorch, TensorFlow, Eclipse Zenoh, DDS, Docker, Git

*Specializations:* Distributed Systems, Parallel Computing, Computer Vision, V2X Communication, Real-time Systems

* Open-Source Projects

- *[[https://newslabntu.github.io/autosdv-book/][AutoSDV]]* (2022–Present): Main contributor to the Autoware Software-Defined Vehicle platform. Provides a complete autonomous driving solution from hardware specifications to software implementation, democratizing self-driving research for educational institutions.

- *[[https://github.com/NEWSLabNTU/ddshark][ddshark]]* (2023): Real-time RTPS protocol analyzer similar to htop, supporting multiple DDS implementations.

- *Additional projects:* [[https://github.com/jerry73204/][github.com/jerry73204]] — Including carla-rust, and other repositories.
