resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hsiang-Jui Lin (Jerry Lin) | 林祥瑞</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.googleapis.com/css2?family=Noto+Serif:wght@400;700&family=Open+Sans:wght@400;600;700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hsiang-Jui Lin (Jerry Lin) | 林祥瑞</h1>
<div class="org-center">
<p>
<b>Email:</b> <a href="mailto:jerry73204@gmail.com">jerry73204@gmail.com</a> | <a href="mailto:d10922013@csie.ntu.edu.tw">d10922013@csie.ntu.edu.tw</a> <br />
<b>GitHub:</b> <a href="https://github.com/jerry73204/">github.com/jerry73204</a> | <b>LinkedIn:</b> <a href="https://www.linkedin.com/in/jerryhj-lin/">linkedin.com/in/jerryhj-lin</a>
</p>
</div>

<hr />

<p>
PhD candidate at National Taiwan University specializing in autonomous vehicle systems, multi-modal sensor fusion, and V2X communication. Systems programmer with expertise in Rust, C/C++, and distributed consensus algorithms. 5+ years of industry experience in R&amp;D roles at Microsoft and ADLINK Technology, with a focus on scalable backend systems and real-time networking.
</p>
<div id="outline-container-org8ee0fcf" class="outline-2">
<h2 id="org8ee0fcf">Education</h2>
<div class="outline-text-2" id="text-org8ee0fcf">
<ul class="org-ul">
<li><b>PhD Program in Computer Science and Information Engineering, National Taiwan University</b> (2021–Present): Advisor: Professor Chi-Sheng Shih | Research: Autonomous vehicles, sensor fusion, V2X communication</li>

<li><b>Master of Science in Computer Science and Information Engineering, National Taiwan University</b> (2021)</li>

<li><b>Bachelor of Science in Computer Science and Information Engineering, National Taiwan University</b> (2016): Thesis: <i>Solving Graph Domination Problems on Distance-Hereditary Graphs Using Split Decomposition</i></li>
</ul>
</div>
</div>
<div id="outline-container-org522cfe1" class="outline-2">
<h2 id="org522cfe1">Research Projects</h2>
<div class="outline-text-2" id="text-org522cfe1">
<ul class="org-ul">
<li><b>AutoSDV (Autoware Software-Defined Vehicle)</b> (2023–Present): Main contributor to <a href="https://newslabntu.github.io/autosdv-book/">AutoSDV</a>, an open-source autonomous driving platform. Designed and implemented the complete vehicle architecture and software stack based on Autoware. Developed hardware integration for practical sensors, enabling affordable self-driving research platforms for educational institutions.</li>

<li><b>Multi-Modal Autonomous Vehicle Communication Control</b> (2023–2024): Led development of innovative communication protocols for heterogeneous autonomous vehicle platforms in collaboration with KingwayTek (勤崴國際).</li>

<li><b>Real-Time Perception and Collaborative Driving</b> (2021–2023): Developed V2V cooperative decision-making algorithms and collaborative perception systems with National Yang Ming Chiao Tung University.</li>

<li><b>Cross-Domain Time-Sensitive Networking</b> (2022–2023): Researched deterministic networking protocols using time-sensitive networking (TSN) technologies for vehicular applications with ADLINK Technology (凌華科技).</li>

<li><b>Smart Cockpit Interactive Systems</b> (2023–2025): Leading research on gesture-based interaction and spatial audio systems for next-generation vehicle interiors with AU Optronics Corporation (友達光電).</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2473ff" class="outline-2">
<h2 id="orgb2473ff">Publications &amp; Presentations</h2>
<div class="outline-text-2" id="text-orgb2473ff">
</div>
<div id="outline-container-orgabc3412" class="outline-3">
<h3 id="orgabc3412">Publications</h3>
<div class="outline-text-3" id="text-orgabc3412">
<ul class="org-ul">
<li><b>Unsupervised Training Framework for 3D Point Cloud Object Detection Model</b> (2025): Developing self-supervised learning approaches for 3D object detection in autonomous driving applications.</li>

<li><b>Self-Supervised Multi-LiDAR Object View Generation Using Single LiDAR</b> (2023): Proposed novel method for generating multi-view LiDAR representations from single sensor input, improving perception robustness.</li>

<li><b>A Performance Study on the Throughput and Latency of Zenoh, MQTT, Kafka, and DDS</b> (2023): Comprehensive evaluation of pub/sub frameworks demonstrating significant throughput improvements in specific scenarios. (1 citation)</li>

<li><b>Scalable and Bounded-time Decisions on Edge Device Networks using Eclipse Zenoh</b> (RTSCA 2022): Developed consensus algorithm achieving deterministic decision-making within 100ms bounds. (4 citations)</li>

<li><b>Prediction of Human Intention in Vehicles, Pedestrians and Bicyclists Interactions</b> (IEEE ITSC 2021): Developed deep learning models for predicting road user behavior, improving autonomous vehicle safety. (1 citation)</li>

<li><b>Master's Thesis: Occlusion-Resistant Tracking Based on Idempotent Adjunction Relationships</b> (2021): Achieved 0.3m average displacement error in vehicle tracking under 70% occlusion conditions.</li>

<li><b>Undergraduate Thesis: Graph Domination Problems on Distance-Hereditary Graphs</b> (2016): Discovered O(n²) algorithm improving upon previous O(n³) solutions.</li>

<li><b>機器人程式設計與實作：使用 Java</b> (Robotic Programming Design and Implementation Using Java) (2013): Published technical book on LEGO NXT robotics programming. ISBN: <a href="http://isbn.ncl.edu.tw/NCL_ISBNNet/main_DisplayRecord.php?PHPSESSID=c8kchinqo5ncq873i47c4sqkb0&amp;Pact=Display&amp;Pstart=1">9789862768228</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge6f5ead" class="outline-3">
<h3 id="orge6f5ead">Presentations</h3>
<div class="outline-text-3" id="text-orge6f5ead">
<ul class="org-ul">
<li><b>ROS2 ♥ Rust</b> (COSCUP 2024): Presented integration techniques for using Rust with ROS2 (Robot Operating System 2), showcasing type-safe robotics programming and performance benefits. <a href="https://coscup.org/2024/zh-TW/session/3XZS7K">Session details</a></li>

<li><b>Highly Performant Dataflow in Stream-Oriented Programming with Rust</b> (COSCUP 2023): Demonstrated significant performance improvements using async stream processing. <a href="https://coscup.org/2023/zh-TW/session/JLZM37">Session details</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaf6366d" class="outline-2">
<h2 id="orgaf6366d">Professional Experience</h2>
<div class="outline-text-2" id="text-orgaf6366d">
<ul class="org-ul">
<li><b>Research &amp; Development Assistant, ADLINK Technology Inc.</b> (2021–2024): Developed distributed consensus algorithms for Eclipse Zenoh middleware, achieving sub-millisecond latency for edge computing applications.</li>

<li><b>Research &amp; Development Assistant, Microsoft Taiwan</b> (2018–2019): Optimized Bing's reverse geocoding backend services, improving query response time and system scalability.</li>

<li><b>Software Developer, CAVEDU Education</b> (CAVEDU 教育團隊) (2010–2016): Led AppInventor curriculum development. Authored technical documentation and conducted workshops on robotics programming.</li>
</ul>
</div>
</div>
<div id="outline-container-org0ad9459" class="outline-2">
<h2 id="org0ad9459">Technical Skills</h2>
<div class="outline-text-2" id="text-org0ad9459">
<p>
<b>Programming Languages:</b> Rust, C/C++, Python, Java, CUDA, OpenCL
</p>

<p>
<b>Frameworks &amp; Tools:</b> Autoware, ROS/ROS2, PyTorch, TensorFlow, Eclipse Zenoh, DDS, Docker, Git
</p>

<p>
<b>Specializations:</b> Distributed Systems, Parallel Computing, Computer Vision, V2X Communication, Real-time Systems
</p>
</div>
</div>
<div id="outline-container-org5177c0e" class="outline-2">
<h2 id="org5177c0e">Open-Source Projects</h2>
<div class="outline-text-2" id="text-org5177c0e">
<ul class="org-ul">
<li><b><a href="https://newslabntu.github.io/autosdv-book/">AutoSDV</a></b> (2022–Present): Main contributor to the Autoware Software-Defined Vehicle platform. Provides a complete autonomous driving solution from hardware specifications to software implementation, democratizing self-driving research for educational institutions.</li>

<li><b><a href="https://github.com/NEWSLabNTU/ddshark">ddshark</a></b> (2023): Real-time RTPS protocol analyzer similar to htop, supporting multiple DDS implementations.</li>

<li><b>Additional projects:</b> <a href="https://github.com/jerry73204/">github.com/jerry73204</a> — Including carla-rust, and other repositories.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
